Repository: jimregan/citizens-information-raw
Catalog: en-ga/www.citizensinformation.ie/ga/justice/criminal_law/criminal_trial/drug_offenders_register.html.txt.tmx
Source language: en
Languages: ga

source: Part 9 of the Criminal Justice Act 2006 came into force in October 2006 and introduced new obligations on those who have been convicted of drug trafficking offences to notify Gardaí of certain information about themselves
ga: Tháinig cuid 9 den Acht um Cheartas Coiriúil 2006 i bhfeidhm i Mí Dheireadh Fómhair 2006 agus thug sé isteach oibleagáidí nua orthu sin a ciontaíodh as cionta gáinneála drugaí in Éirinn d’fhonn faisnéis éigin a thabhairt do na Gardaí fúthu féin

source: This provision is based on the same principle as the Sex Offenders Register and enables the movements of convicted drug dealers to be recorded in a similar fashion
ga: Tá an fhoráil seo bunaithe ar an bprionsabal céanna le Clár na gCiontóirí Gnéis agus cuireann sé ar chumas na nÚdarás gluaiseachtaí gáinneálaithe drugaí a thaifeadadh ar an dóigh chéanna

source: Furthermore, the Register assists the Gardaí in monitoring illegal activity and provides useful intelligence on convicted offenders
ga: Lena chois sin, cuidíonn an Clár leis na Gardaí agus iad ag déanamh monatóireachta ar ghníomhaíocht mhídhleathach agus cuireann sé faisnéis úsáideach ar fáil faoi chiontóirí a ciontaíodh

source: This document sets out the duties of offenders to notify the Gardaí
ga: Leagann an doiciméad seo amach na dualgais atá ar chiontóirí faisnéis a chur in iúl do na Gardaí

source: Information on penalties for those who fail to comply is also provided
ga: Cuirtear faisnéis ar fáil chomh maith faoi phionóis dóibh siúd nach gcomhlíonann na dualgais seo

source: How soon after conviction must I notify Gardaí?
ga: Cé chomh luath i ndiaidh ciontaithe a mbeidh orm é a chur in iúl do na Gardaí?

source: If you are convicted of a drug trafficking offence you are required to notify the Gardaí of certain information about yourself within 7 days
ga: Má chiontaítear thú as cion gáinneála drugaí ní mór duit roinnt faisnéise fút féin a thabhairt do na Gardaí laistigh de 7 lá

source: When you receive a term of imprisonment following a drug conviction, your duty to notify the Gardaí doesn’t begin until after you are released from prison
ga: Nuair a ghearrtar téarma príosúnachta ort i ndiaidh ciontaithe drugaí, ní thosaíonn an dualgas atá ort na é a chur in iúl do na Gardaí go dtí go scaoiltear as an bpríosún thú

source: You then have 7 days from the date of release to notify the Gardaí
ga: Ansin beidh 7 lá agat ó dháta do scaoilte leis na Gardaí a chur ar an eolas

source: The Governor of the prison is obliged to notify the Gardaí at least 10 days before your release that you are going to be released
ga: Tá oibleagáid ar Ghobharnóir an phríosúin a chur in iúl do na Gardaí go bhfuil tú le scaoileadh saor ar a laghad 10 lá sula scaoiltear saor thú

source: What information am I required to give the Gardaí?
ga: Cén fhaisnéis a chaithfidh mé a thabhairt do na Gardaí?

source: When an order is made by a court requiring you to notify Gardaí you are obliged to supply the following information in order to comply with the requirements:
ga: Nuair a dhéanann cúirt ordú go gcaithfidh tú na Gardaí a chur ar an eolas tá oibleagáid ort an fhaisnéis seo a leanas a sholáthar leis na riachtanais a chomhlíonadh:

source: • Your name and if you use another name(s), each of those names
ga: • D’ainm agus má úsáideann tú ainm(neacha) eile, gach ceann de na hainmneacha sin

source: • If you change your name from the one previously given to the Gardaí then you must provide that new name within 7 days of any such change of name
ga: • Má athraíonn tú d’ainm ó cheann a tugadh roimhe sin do na Gardaí beidh ort an t-ainm nua a sholáthar laistigh de 7 lá ó aon athrú ainm den chineál sin

source: • Any change of your home address
ga: • Aon athrú ar do sheoladh baile

source: • If you intend to leave the state for a continuous period of 7 days or more then you must notify the Gardaí of your intention and of where they intend to stay while outside the state
ga: • Má tá rún agat an stát a fhágáil ar feadh tréimhse leanúnach de 7 lá nó níos mó beidh ort an rún sin a chur in iúl do na Gardaí agus a chur in iúl dóibh cá bhfuil sé de rún agat stopadh agus tú lasmuigh den stát

source: How long do the requirements to notify the Gardaí last for?
ga: Cá fhad a mhaireann na riachtanais maidir leis na Gardaí a fhaisnéisiú?

source: It depends on the length of sentence you receive from the court
ga: Braitheann sé ar fhad na pianbhreithe a fhaigheann tú ón chúirt

source: The longer the sentence, the longer the requirements last
ga: Dá fhaide an phianbhreith, is amhlaidh is faide a mhaireann na riachtanais

source: The following is a guide to the length of time the requirements last:
ga: Seo treoir ar fhad an ama a mhaireann na riachtanais:

source: • 12 years: if you were imprisoned for life (life normally meaning 14 years or less in prison)
ga: • 12 bliana: má bhí príosúnacht saoil ort (de ghnáth ciallaíonn saol 14 bliana nó níos lú i bpríosún)

source: • 7 years: if you were imprisoned more than 10 years (but not imprisonment for life)
ga: • 7 mbliana: má tugadh níos mó ná 10 mbliana príosúnachta duit (ach ní príosúnacht saoil)

source: • 5 years: if you were imprisoned for more than 5 years (but not more than 10 years)
ga: • 5 bliana: má gearradh níos mó ná 5 bliana príosúnachta ort (ach gan níos mó ná 10 mbliana)

source: • 3 years: if you were imprisoned for more than one year (but not more than 5 years)
ga: • 3 bliana: má gearradh níos mó ná aon bhliain príosúnachta ort (ach ní níos mó ná 5 bliana)

source: • 1 year: if your imprisonment is suspended by the court
ga: • 1 bhliain: má chuir an chúirt do phríosúnacht ar fionraí

source: Do offenders under 18 also have to notify the Gardaí?
ga: An gcaithfidh ciontóirí faoi 18 na Gardaí a chur ar an eolas chomh maith?

source: Yes, those under 18 years at time of sentencing are also obliged to notify the Gardaí – but the periods are shorter
ga: Caithfidh. Tá daoine faoi 18 mbliana d’aois iad faoi oibleagáid na Gardaí a chur ar an eolas nuair a ghearrtar pianbhreith orthu chomh maith, ach tá na tréimhsí níos gairide

source: They are as follows:
ga: Tá siad mar a leanas:

source: • 6 years: if you were imprisoned for life, (life normally meaning 14 years or less in prison)
ga: • 6 bliana: má gearradh príosúnacht saoil ort, (a chiallaíonn de ghnáth 14 bliana nó níos lú i bpríosún)

source: • 3.5 years: if you were imprisoned more than 10 years (but not imprisonment for life)
ga: • 3.5 bliain: má gearradh príosúnacht níos mó ná 10 mbliana ort (ach ní príosúnacht saoil)

source: • 2.5 years: if you were imprisoned for more than 5 years (but not more than 10 years)
ga: • 2.5 bliain: má gearradh príosúnacht níos mó ná 5 bliana ort (ach níos lú ná 10)

source: • 1.5 years: if you were imprisoned for more than one year (but not more than 5 years)
ga: • 1.5 bliain: más amhlaidh gur gearradh príosúnacht ort de níos mó ná aon bhliain amháin (ach nach raibh níos mó ná 5 bliana)

source: • Six months: if your imprisonment is suspended by the court
ga: • Sé mhí: má chuir an chúirt do phríosúnacht ar fionraí

source: Can I apply to have the notification requirements cancelled?
ga: An féidir liom iarratas a dhéanamh le riachtanais an fhaisnéisithe a chur ar ceal?

source: Anyone subject to the requirements for a period of 12 years (or 6 years in the case of someone under 18 years of age) can apply to the court for an order discharging them from having to notify the Gardaí on the grounds that the interests of the common good is not being served by you being obliged to continue to notify
ga: Is féidir le duine ar bith atá faoi réir na riachtanas le haghaidh tréimhse 12 bliana (nó 6 bliana i gcás duine faoi 18 mbliana d’aois) ordú a iarraidh ar an gcúirt iad a úrscaoileadh ón riachtanas na Gardaí a chur ar an eolas ar an bhforas nach mbeadh sé chun tairbhe na maitheasa poiblí oibleagáid a bheith ort leanúint leat ag faisnéisiú

source: You should apply to the court which imposed the prison sentence originally
ga: Ba chóir duit iarratas a chur isteach chuig an gcúirt a ghearr an pianbhreith príosúnachta sa chéad áit

source: The application may be made by you or by a solicitor on your behalf
ga: Is féidir leatsa iarratas a dhéanamh nó is féidir le aturnae an t-iarratas a dhéanamh ar do shon

source: Court staff will assist in making the application if you have any difficulties
ga: Cuideoidh foireann na cúirte leis an iarratas a dhéanamh má bhíonn deacrachtaí ar bith ann

source: There is no charge for an application
ga: Ní chosnaíonn sé rud ar bith iarratas a dhéanamh

source: Anyone applying to the court is allowed to bring forward any witness to the court who will give evidence on their behalf or in regard to their character, for example, a doctor who had treated you or the director of a drugs rehabilitation programme which you attended
ga: Tá cead ag aon duine atá ag cur iarratais chuig an gcúirt aon fhinné a thabhairt leo chuig an gcúirt a thabharfaidh fianaise ar a son nó maidir lena gcarachtar, mar shampla, dochtúir a thug cóireáil duit nó stiúrthóir clár athshlánaithe ar fhreastail tú air

source: If you intend to apply to the court for a discharge of the requirements to report to the Gardaí, you must notify the Superintendent of the local Garda station of your intention to make an application to the court
ga: Má tá rún agat a iarraidh ar an gcúirt na riachtanais maidir le tuairisciú chuig na Gardaí a urscaoileadh, ní mór duit a chur in iúl do Cheannfort do stáisiúin áitiúil Ghardaí go bhfuil sé de rún agat iarratas a dhéanamh chuig an gcúirt

source: How soon can I apply to the court?
ga: Cé chomh luath a thig liom iarratas a dhéanamh chuig an gcúirt?

source: People who are subject to the Garda notification requirements for a period of 12 years can’t apply to the court for a discharge until 8 years have passed
ga: Daoine atá faoi réir riachtanais faisnéisithe na nGardaí do thréimhse de 12 bliana, ní féidir leo urscaoileadh a iarraidh ar an gcúirt go dtí go bhfuil 8 mbliana thart

source: This means that you must comply with the requirement of reporting to the Gardaí for at least 8 years
ga: Ciallaíonn sé seo go gcaithfidh tú an riachtanas maidir le tuairisciú leis na Gardaí a chomhlíonadh go ceann 8 mbliana ar a laghad

source: Similarly anyone under the age of 18 years at the time of sentence who is subject to the notification requirements for 6 years must remain subject to these requirements for 4 years before they can apply to the court for a discharge of the order
ga: Ar an mbealach céanna, caithfidh aon duine atá faoi 18 mbliana d’aois nuair a dhaortar iad agus atá faoi réir na riachtanas faisnéisithe ar feadh 6 bliana, caithfidh siad fanacht faoi réir na riachtanas seo go ceann 4 bliana sula mbeidh siad in ann urscaoileadh an ordaithe a iarraidh ar an gcúirt

source: What happens when someone fails to comply with the notification requirements?
ga: Cad é a tharlóidh mura gcomhlíonann duine na riachtanais faisnéisithe?

source: Anyone who fails (without reasonable excuse), to comply with the notification requirement is guilty of an offence
ga: Tá aon duine nach gcomhlíonann an riachtanas faisnéisithe (gan leithscéal réasúnta a bheith acu) ciontach i gcion

source: The penalty is a fine of up to €3,000 or imprisonment for up to 12 months, or both
ga: Is é an pionós ná fíneáil suas le €3000 nó príosúnacht suas le 12 mhí, nó an dá rud

source: Do these notification requirements apply to persons convicted outside the state?
ga: An bhfuil na riachtanais faisnéisithe seo i bhfeidhm ar dhaoine a ciontaíodh lasmuigh den stát?

source: If you are convicted of a drug trafficking offence outside Ireland where that offence would constitute a drug trafficking offence in Ireland, you are subject to the same Garda notification requirements if you subsequently come to live in Ireland
ga: Má chiontaítear thú i gcion gáinneála drugaí taobh amuigh d’Éirinn agus dá mbeadh an cion céanna ina chion gáinneála drugaí in Éirinn, beidh tú faoi réir riachtanas faisnéisithe céanna na nGardaí má thagann tú le cónaí in Éirinn ina dhiaidh sin

source: If you fail to notify the Gardaí of your details, then the Gardaí can prosecute you for non-compliance or failure to comply with the requirements
ga: Mura gcuireann tú do shonraí in iúil do na Gardaí, is féidir leis na Gardaí tú a chúiseamh as neamh-chomhlíonadh nó loiceadh cloí leis na riachtanais

source: The Gardaí, however, have to produce a document to the court proving the particulars of your conviction abroad
ga: Beidh ar na Gardaí, áfach, doiciméad a thabhairt ar aird don chúirt ag cruthú shonraí do chiontaithe
